perf/artillery-visit.yml
config:
  target: "{{ BASE_URL }}"
  phases:
    - duration: 60
      arrivalRate: 2
      name: warmup
    - duration: 120
      arrivalRate: 5
      name: ramp
  defaults:
    headers:
      Content-Type: application/json
  processor: |
    function setAuthToken(req, res, context, ee, next) {
      const token = res.json?.data?.access_token;
      if (token) {
        context.vars.token = token;
      }
      return next();
    }
scenarios:
  - name: Visit checkin + checkout
    flow:
      - post:
          url: "/api/user/login"
          json:
            version: "1.0.3"
            username: "{{ USERNAME }}"
            password: "{{ PASSWORD }}"
            notif_id: "test-onesignal-id"
          capture:
            - json: "data.access_token"
              as: token
          afterResponse: setAuthToken
      - think: 1
      - post:
          url: "/api/visit"
          headers:
            Authorization: "Bearer {{ token }}"
          formData:
            kode_outlet: "{{ OUTLET_CODE }}"
            picture_visit:
              - value: "@perf/assets/photo.jpg"
                options:
                  filename: "in.jpg"
                  contentType: "image/jpeg"
            latlong_in: "0,0"
            tipe_visit: "ROUTINE"
      - think: 1
      - post:
          url: "/api/visit"
          headers:
            Authorization: "Bearer {{ token }}"
          formData:
            latlong_out: "0,0"
            laporan_visit: "OK"
            picture_visit:
              - value: "@perf/assets/photo.jpg"
                options:
                  filename: "out.jpg"
                  contentType: "image/jpeg"
            transaksi: "YES"